{
  "EXPERIENCE": "experiência profissional",
  "PROFESSION": "Engenheiro Civil",
  "SECOND_PROFESSION": "Engenheiro de Software",
  "EDUCATION": "educação",
  "LANGUAGE": "idiomas",
  "SKILL": "habilidades & ferramentas",
  "FEATURE": "destaques",
  "VOLUNTER": "voluntariado",
  "ABOUT": "sobre mim",
  "PROJECT": "projetos",
  "ABOUT_DESCRIPTION": [
    "Desde 2018, Jorge Alarcón tem aprimorado sua experiência em Desenvolvimento Web e Ciência de Dados, atualmente trabalhando e ganhando experiência como Full Stack DevOps e Engenheiro de Dados. Anteriormente, trabalhou como Engenheiro Civil no Peru e no Brasil.",
    "Com mais de sete anos de sólida experiência em Linux, Jorge Alarcón se especializa no desenvolvimento de pipelines de dados, APIs REST, protocolo gRPC como microsserviços e aplicações web. Sua experiência se destaca por sua abordagem abrangente para implementar e orquestrar serviços em nuvem por meio de IaC na AWS e Linode, integrando práticas de CI/CD e aplicando o Desenvolvimento Orientado por Testes (TDD) e uma arquitetura limpa para garantir eficiência e confiabilidade em cada fase do projeto."
  ],
  "VOLUNTEER": [
    {
      "organization": "AIESEC na Colômbia",
      "description": "9000xBogotá é uma iniciativa da AIESEC que demonstra aos cidadãos de Bogotá que jovens de várias nacionalidades podem sentir empatia e respeito pela cidade que se torna seu lar temporário, enquanto também aumenta a conscientização social e fornece informações sobre a importância do aquecimento global.",
      "name": "Universidade dos Andes, Colômbia: 7000xBogotá",
      "start": "Dez 2010",
      "end": "Mar 2011",
      "location": "Bogotá, Colômbia"
    }
  ],
  "EDUCATIONS": [
    {
      "certification": "cientista de dados",
      "link": "https://www.dropbox.com/s/aitq1wbqt8dwtek/Henry%20certificate%20-%20Jorge%20Ramiro%20Alarc%C3%B3n%20Vargas.pdf?dl=0",
      "code": "",
      "name": "Soy Henry",
      "start": "Mar 2022",
      "end": "Set 2022",
      "location": "Argentina"
    },
    {
      "certification": "engenheiro civil",
      "link": "https://cipvirtual.cip.org.pe/sicecolegiacionweb/externo/consultaCol/",
      "code": "CIP 257513",
      "name": "Universidade Católica de Santa María",
      "start": "Jan 2008",
      "end": "Dez 2014",
      "location": "Arequipa, Peru"
    }
  ],
  "LANGUAGES": {
    "english": "Proficiência em exercício.",
    "portugues": "Proficiência completa.",
    "spanish": "Nativo ou bilíngue."
  },
  "FEATURES": [
    {
      "name": "II CONGRESSO INTERNACIONAL DE ENGENHARIA CIVIL II CIDEIC UCSM 2021",
      "title": "PALESTRANTE \"Desenvolvimento Web para Engenheiro Civil\"",
      "location": "Arequipa, Arequipa, Peru",
      "start": "Nov 2021",
      "end": "Nov 2021",
      "responsibilities": [
        "De 15 a 19 de novembro de 2021, a Universidade Católica Privada de Santa María de Arequipa, Peru, sediou o \"II CONGRESSO INTERNACIONAL DE ESTUDANTES DE ENGENHARIA CIVIL\".",
        "Tópicos: sistemas operacionais, introdução à interface da linha de comando (CLI), conceitos básicos do IOT, características do Front-End e Back-End, introdução a bancos de dados SQL, demonstração do desenvolvimento e deploy de um projeto, e por último mas não menos importante, uma demonstração ao vivo da ferramenta CVS mais popular (Git & GitHub)."
      ]
    }
  ],
  "PROJECTS": {
    "RPG Labs - Grupo RPG SAC": {
      "title": "Aplicação Web para Serviços de Teste em um Laboratório de Solos de Engenharia Civil",
      "link": "https://github.com/jorgeav527/rpg_labs_repo.git",
      "start": "Dez 2021",
      "end": "Mar 2022",
      "techstack": [
        "OS Linux, Git & GitHub (GitHub Flow), HTML, CSS-BootstrapMade, Django, HTMX, Nginx, Bash, Docker, Html2pdf, PostgreSQL, AWS (EC2 & RDS & S3)."
      ]
    },
    "EPIC Labs - Tese de Graduação Profissional": {
      "title": "Tese: Automação e Sistematização de Laboratório de Engenharia Civil",
      "location": "Arequipa, Arequipa, Peru",
      "link": "https://github.com/jorgeav527/epiclabs.git",
      "start": "Dez 2019",
      "end": "Dez 2020",
      "techstack": [
        "OS Linux, Git & GitHub, HTML, CSS-Bootstrap, Django, Matplotlib & Bokeh, WeasyPrint, SQLite, PythonAnywhere."
      ]
    },
    "Projeto final do Bootcamp de Ciência de Dados da Henry": {
      "title": "Expectativa de Vida - ETL & EDA & ML",
      "link": "https://github.com/jorgeav527/life-expectancy.git",
      "start": "Set 2022",
      "end": "Out 2022",
      "techstack": [
        "OS Linux, Git & GitHub & Git LFS, Jupyter (Numpy & Pandas & Scikit-Learn, Matplotlib), Heroku, MongoDB, ElephantSQL, FastAPI, Streamlit, Apache Airflow, Docker, Linode (EC2 & RDS & S3)."
      ]
    },
    "Especialização em Machine Learning": {
      "title": "Datathon - Aplicando Modelagem ML",
      "link": "https://github.com/jorgeav527/Datathon.git",
      "start": "Set 2022",
      "end": "Presente",
      "techstack": ["Jupyter (Numpy & Pandas & Scikit-Learn & Plotly)."]
    }
  },
  "CIVIL_EXPERIENCES": [
    {
      "company": "Prefeitura Distrital de Majes",
      "title": "Engenheiro Civil",
      "location": "Majes, Arequipa, Peru",
      "type": "Presencial, Tempo integral",
      "start": "Mai 2021",
      "end": "Ago 2021",
      "time": "4 meses",
      "responsibilities": [
        "Assistência no relatório e revisão de liquidações técnico-financeiras de projetos de investimento público, identificação e registro de Investimentos Públicos (IOARR), de acordo com a Diretiva de Serviços de Pagamento da Lei de Contratação do Estado.",
        "Revisão e relatório sobre os adicionais, dedutivos e extensões de investimento dos projetos públicos.",
        "Revisão mensal dos resíduos gerados em projetos públicos e recuperação adequada de resíduos.",
        "Monitoramento e atualização da gestão e cronograma de vários projetos públicos via plataformas web online (Formulário 12B)."
      ]
    },
    {
      "company": "Juares Arquitectos & Ingenieros SAC",
      "title": "Engenheiro Civil",
      "location": "Arequipa, Arequipa, Peru",
      "type": "Presencial, Freelancer",
      "start": "Nov 2018",
      "end": "Nov 2019",
      "time": "1 ano",
      "responsibilities": [
        "Suporte profissional em detalhes técnicos e estruturais de edifícios e muros de contenção.",
        "Controle detalhado, eficiente e diário, semanal e mensal do trabalho programado através da ferramenta MS Project.",
        "Relatório de avaliações mensais do trabalho, apresentado em Excel.",
        "Criação de relatório e previsão de trabalho adicional, aumentos de capital e aumentos de custo."
      ]
    },
    {
      "company": "FourC Bilingual Academy",
      "title": "Manutenção de Engenharia de Edifícios",
      "location": "Bauru, São Paulo, Brasil",
      "type": "Presencial, Estágio",
      "start": "Jun 2016",
      "end": "Dez 2017",
      "time": "1 ano 6 meses",
      "responsibilities": [
        "Suporte profissional na resolução de defeitos de construção com previsões e múltiplas soluções.",
        "Controle detalhado e eficiente da agenda diária, semanal e mensal da equipe de manutenção com MS Project.",
        "Reduzi o consumo de água potável em 30% e o consumo mensal de eletricidade em 11% usando dados pré-existentes."
      ]
    }
  ],
  "SOFTWARE_EXPERIENCES": [
    {
      "company": "Roadr",
      "title": "Full-Stack DevOps & Engenheiro de Dados",
      "location": "Los Angeles, Califórnia, Estados Unidos",
      "type": "Remoto, Tempo integral",
      "start": "Fev 2023",
      "end": "Presente",
      "time": "1 ano + 7 meses",
      "responsibilities": [
        "FULL-STACK DEVOPS",
        "Trabalhei com uma variedade de stacks tecnológicos, incluindo Node com Express e React, GO com Fiber e Python com Django, FastAPI e Airflow.",
        "Contenerizei inúmeros frameworks usando Docker e implantei e gerenciei aplicações alocadas na nuvem, incorporando práticas de Infraestrutura como Código (IaC) com ferramentas como Terraform e Ansible, em plataformas como AWS e Linode.",
        "Tenho uma sólida base em operações Unix/Linux e trabalhei extensivamente com ferramentas essenciais de CI/CD, como Jenkins ou GitHub Actions, implementando Gitflow como parte do meu fluxo de trabalho.",
        "Gerenciei bancos de dados como MongoDB, PostgreSQL e Cassandra para Desenvolvimento Guiado por Modelos (MDD), e utilizei serviços como Kafka e Redis para desenvolvimento orientado a eventos, processamento de dados e mensagens, juntamente com desenvolvimento utilizando GraphQL.",
        "Também monitorei instâncias de forma eficaz com Netdata, garantindo desempenho ótimo e confiabilidade.",
        "ENGENHEIRO DE DADOS",
        "Sou responsável por extrair, projetar, construir e manter a infraestrutura de dados que alimenta a tomada de decisões baseada em dados de nossa organização.",
        "Projetei, desenvolvi e implantei APIs usando FastAPI para um serviço de dashboard, utilizando Docker e adotando as melhores práticas, como arquitetura limpa, linting, formatação e tipagem. Meu enfoque de desenvolvimento incorpora Desenvolvimento Orientado por Testes (TDD) e integrei serviços como MongoDB, Redis (para funcionalidade pub/sub) e GraphQL.",
        "Assim que o aplicativo é lançado, projetei, desenvolvi e implantei um pipeline de Airflow usando Docker. Orquestrei serviços para um aplicativo web que utiliza MongoDB, utilizei um bucket S3 para um data lake e empreguei PostgreSQL ou Cassandra para um data warehouse. Os processos ETL são capazes de lidar com tarefas tanto em lote quanto em streaming, usando Kafka ou Redis pub/sub."
      ]
    },
    {
      "company": "Cibertec",
      "title": "Instrutor de Fundamentos de Python para Ciência de Dados",
      "location": "Lima, Peru",
      "type": "Remoto, Meio período",
      "start": "Out 2023",
      "end": "Ago 2024",
      "time": "10 meses",
      "responsibilities": [
        "Orientação e mentoria para estudantes, ajudando-os a navegar por suas trajetórias profissionais e tomar decisões informadas relacionadas à ciência de dados.",
        "Avaliação do desempenho dos estudantes através de trabalhos, quizzes, exames e projetos.",
        "Fornecimento de feedback construtivo para ajudar os estudantes a melhorarem suas habilidades com Python."
      ]
    },
    {
      "company": "Grupo RPG SAC",
      "title": "Desenvolvedor Web e Automação de TI em um Laboratório de Solos",
      "location": "Tiabaya, Arequipa, Peru",
      "type": "Híbrido, Freelancer",
      "start": "Dez 2021",
      "end": "Mar 2022",
      "time": "4 meses",
      "responsibilities": [
        "Construí um espaço virtual Docker usando Django, HTMX e Postgres montado em uma instância EC2 nos servidores AWS, com RDS para o backup e restauração do banco de dados relacional e usando S3 para as imagens e relatórios em PDF.",
        "Planejei e realizei a análise de informações, projetei, desenvolvi e implantei uma ferramenta web que atende aos requisitos e necessidades do laboratório.",
        "No PRIMEIRO MÓDULO \"COTAÇÕES\" a aplicação web tem a funcionalidade de registrar clientes e fazer cotações para os testes requeridos. Em seguida, para os testes que foram realizados, criar uma ordem de serviço e uma folha de liquidação."
      ]
    },
    {
      "company": "UCSM - EPIC Labs",
      "title": "Desenvolvedor Web e Automação de TI nos Laboratórios da EPIC",
      "location": "Tiabaya, Arequipa, Peru",
      "type": "Híbrido, Freelancer",
      "start": "Dez 2019",
      "end": "Jan 2021",
      "time": "1 ano 2 meses",
      "responsibilities": [
        "Construí uma ferramenta de aplicação web usando HTML/CSS, JavaScript, jQuery, Django e SQLite, montada em uma instância EC2 nos servidores PythonAnywhere.",
        "Desenhei o fluxo de processo de planejamento para estudantes, pesquisadores de tese e clientes externos com base nas necessidades do laboratório, e implementei um tipo de arquitetura SaaS.",
        "Como um projeto piloto. Planejei e realizei a análise de informações, projetei, desenvolvi e implantei uma ferramenta web que atende aos requisitos e necessidades do laboratório."
      ]
    }
  ],
  "SKILLS": {
    "Full-Stack DevOps": [
      "OS Linux",
      "Bash",
      "Svelt | HTMX",
      "Django & FastAPI",
      "Fiber",
      "Git & GitHub",
      "PostgreSQL & MongoDB",
      "Redis",
      "Docker",
      "Jenkins",
      "Terraform",
      "Ansible",
      "Linode",
      "Nginx",
      "AWS (IAM, EC2, RDS, S3)"
    ],
    "Data Engineering": [
      "Jupyter Notebook",
      "Pandas",
      "Cassandra",
      "Neo4j",
      "Apache Spark",
      "Apache Airflow",
      "Apache Kafka",
      "Databricks",
      "Streamlit",
      "PowerBI",
      "Dash Plotly"
    ],
    "Civil Engineering Background": [
      "Excel",
      "MS-Project",
      "AutoCad",
      "Civil3D",
      "Revit",
      "ArcGis",
      "QGis",
      "SAP2000",
      "BIM"
    ]
  }
}
